ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M2351/TARGET_NUMAKER_PFM_M2351/PeripheralPins.c
const PinMap PinMap_ADC[] = {
    {PB_0, ADC_0_0, SYS_GPB_MFPL_PB0MFP_EADC0_CH0},
    {PB_1, ADC_0_1, SYS_GPB_MFPL_PB1MFP_EADC0_CH1},
    {PB_2, ADC_0_2, SYS_GPB_MFPL_PB2MFP_EADC0_CH2},
    {PB_3, ADC_0_3, SYS_GPB_MFPL_PB3MFP_EADC0_CH3},
    {PB_4, ADC_0_4, SYS_GPB_MFPL_PB4MFP_EADC0_CH4},
    {PB_5, ADC_0_13, SYS_GPB_MFPL_PB5MFP_EADC0_CH13},
    {PB_6, ADC_0_14, SYS_GPB_MFPL_PB6MFP_EADC0_CH14},
    {PB_7, ADC_0_15, SYS_GPB_MFPL_PB7MFP_EADC0_CH15},
    {PB_8, ADC_0_5, SYS_GPB_MFPH_PB8MFP_EADC0_CH5},
    {PB_9, ADC_0_6, SYS_GPB_MFPH_PB9MFP_EADC0_CH6},
    {PB_10, ADC_0_7, SYS_GPB_MFPH_PB10MFP_EADC0_CH7},
    {PB_11, ADC_0_8, SYS_GPB_MFPH_PB11MFP_EADC0_CH8},
    {PB_12, ADC_0_9, SYS_GPB_MFPH_PB12MFP_EADC0_CH9},
    {PB_13, ADC_0_10, SYS_GPB_MFPH_PB13MFP_EADC0_CH10},
    {PB_14, ADC_0_11, SYS_GPB_MFPH_PB14MFP_EADC0_CH11},
    {PB_15, ADC_0_12, SYS_GPB_MFPH_PB15MFP_EADC0_CH12},
    
    {NC,   NC,    0}
};

//*** I2C ***

const PinMap PinMap_I2C_SDA[] = {
    {PA_1, I2C_2, SYS_GPA_MFPL_PA1MFP_I2C2_SDA},
    {PA_2, I2C_0, SYS_GPA_MFPL_PA2MFP_I2C0_SDA},
    {PB_0, I2C_2, SYS_GPB_MFPL_PB0MFP_I2C2_SDA},
    {PD_4, I2C_0, SYS_GPD_MFPL_PD4MFP_I2C0_SDA},
    {PD_8, I2C_0, SYS_GPD_MFPH_PD8MFP_I2C0_SDA},
    {PE_0, I2C_1, SYS_GPE_MFPL_PE0MFP_I2C1_SDA},
    {PE_5, I2C_1, SYS_GPE_MFPL_PE5MFP_I2C1_SDA},
    {PE_9, I2C_1, SYS_GPE_MFPH_PE9MFP_I2C1_SDA},
    {PE_11, I2C_1, SYS_GPE_MFPH_PE11MFP_I2C1_SDA},
    {PE_13, I2C_0, SYS_GPE_MFPH_PE13MFP_I2C0_SDA},
    {PF_4, I2C_1, SYS_GPF_MFPL_PF4MFP_I2C1_SDA},
    {PF_6, I2C_0, SYS_GPF_MFPL_PF6MFP_I2C0_SDA},
    {PF_11, I2C_2, SYS_GPF_MFPH_PF11MFP_I2C2_SDA},
    {PF_13, I2C_0, SYS_GPF_MFPH_PF13MFP_I2C0_SDA},
    {PF_15, I2C_1, SYS_GPF_MFPH_PF15MFP_I2C1_SDA},
    
    {NC,    NC,    0}
};

const PinMap PinMap_I2C_SCL[] = {
    {PA_0, I2C_2, SYS_GPA_MFPL_PA0MFP_I2C2_SCL},
    {PA_3, I2C_0, SYS_GPA_MFPL_PA3MFP_I2C0_SCL},
    {PB_1, I2C_2, SYS_GPB_MFPL_PB1MFP_I2C2_SCL},
    {PC_4, I2C_1, SYS_GPC_MFPL_PC4MFP_I2C1_SCL},
    {PD_5, I2C_0, SYS_GPD_MFPL_PD5MFP_I2C0_SCL},
    {PD_9, I2C_0, SYS_GPD_MFPH_PD9MFP_I2C0_SCL},
    {PE_4, I2C_1, SYS_GPE_MFPL_PE4MFP_I2C1_SCL},
    {PE_8, I2C_1, SYS_GPE_MFPH_PE8MFP_I2C1_SCL},
    {PE_10, I2C_1, SYS_GPE_MFPH_PE10MFP_I2C1_SCL},
    {PE_12, I2C_0, SYS_GPE_MFPH_PE12MFP_I2C0_SCL},
    {PF_3, I2C_1, SYS_GPF_MFPL_PF3MFP_I2C1_SCL},
    {PF_5, I2C_0, SYS_GPF_MFPL_PF5MFP_I2C0_SCL},
    {PF_10, I2C_2, SYS_GPF_MFPH_PF10MFP_I2C2_SCL},
    {PF_12, I2C_0, SYS_GPF_MFPH_PF12MFP_I2C0_SCL},
    {PF_14, I2C_1, SYS_GPF_MFPH_PF14MFP_I2C1_SCL},
    
    {NC,    NC,    0}
};

//*** PWM ***

const PinMap PinMap_PWM[] = {
    {PA_0, PWM_1_5, SYS_GPA_MFPL_PA0MFP_PWM1_CH5},
    {PA_1, PWM_1_4, SYS_GPA_MFPL_PA1MFP_PWM1_CH4},
    {PA_2, BPWM_1_3, SYS_GPA_MFPL_PA2MFP_BPWM1_CH3},
    {PA_2, PWM_1_3, SYS_GPA_MFPL_PA2MFP_PWM1_CH3},
    {PA_3, BPWM_1_2, SYS_GPA_MFPL_PA3MFP_BPWM1_CH2},
    {PA_3, PWM_1_2, SYS_GPA_MFPL_PA3MFP_PWM1_CH2},
    {PA_12, BPWM_0_5, SYS_GPA_MFPH_PA12MFP_BPWM0_CH5},
    {PA_14, BPWM_1_0, SYS_GPA_MFPH_PA14MFP_BPWM1_CH0},
    {PA_15, BPWM_1_1, SYS_GPA_MFPH_PA15MFP_BPWM1_CH1},
    {PA_15, PWM_1_0, SYS_GPA_MFPH_PA15MFP_PWM1_CH0},
    {PB_0, PWM_1_5, SYS_GPB_MFPL_PB0MFP_PWM1_CH5},
    {PB_2, PWM_1_4, SYS_GPB_MFPL_PB2MFP_PWM1_CH4},
    {PB_3, PWM_1_3, SYS_GPB_MFPL_PB3MFP_PWM1_CH3},
    {PB_4, PWM_1_2, SYS_GPB_MFPL_PB4MFP_PWM1_CH2},
    {PB_6, BPWM_0_0, SYS_GPB_MFPL_PB6MFP_BPWM0_CH0},
    {PB_6, PWM_1_0, SYS_GPB_MFPL_PB6MFP_PWM1_CH0},
    {PB_7, BPWM_0_1, SYS_GPB_MFPL_PB7MFP_BPWM0_CH1},
    {PB_7, PWM_1_1, SYS_GPB_MFPL_PB7MFP_PWM1_CH1},
    {PB_8, PWM_0_2, SYS_GPB_MFPH_PB8MFP_PWM0_CH2},
    {PC_0, PWM_0_0, SYS_GPC_MFPL_PC0MFP_PWM0_CH0},
    {PC_1, PWM_0_1, SYS_GPC_MFPL_PC1MFP_PWM0_CH1},
    {PC_2, PWM_0_2, SYS_GPC_MFPL_PC2MFP_PWM0_CH2},
    {PC_3, PWM_0_3, SYS_GPC_MFPL_PC3MFP_PWM0_CH3},
    {PC_4, PWM_0_4, SYS_GPC_MFPL_PC4MFP_PWM0_CH4},
    {PC_5, BPWM_0_1, SYS_GPC_MFPL_PC5MFP_BPWM0_CH1},
    {PC_5, PWM_0_1, SYS_GPC_MFPL_PC5MFP_PWM0_CH1},
    {PC_6, PWM_1_0, SYS_GPC_MFPL_PC6MFP_PWM1_CH0},
    {PC_7, PWM_1_1, SYS_GPC_MFPL_PC7MFP_PWM1_CH1},
    {PC_8, BPWM_0_0, SYS_GPC_MFPH_PC8MFP_BPWM0_CH0},
    {PC_9, PWM_1_0, SYS_GPC_MFPH_PC9MFP_PWM1_CH0},
    {PC_10, PWM_1_1, SYS_GPC_MFPH_PC10MFP_PWM1_CH1},
    {PC_11, PWM_1_2, SYS_GPC_MFPH_PC11MFP_PWM1_CH2},
    {PC_12, PWM_1_3, SYS_GPC_MFPH_PC12MFP_PWM1_CH3},
    {PC_13, PWM_1_4, SYS_GPC_MFPH_PC13MFP_PWM1_CH4},
    {PC_14, PWM_1_5, SYS_GPC_MFPH_PC14MFP_PWM1_CH5},
    {PC_15, PWM_1_0, SYS_GPC_MFPH_PC15MFP_PWM1_CH0},
    {PD_0, BPWM_0_2, SYS_GPD_MFPL_PD0MFP_BPWM0_CH2},
    {PD_1, BPWM_0_3, SYS_GPD_MFPL_PD1MFP_BPWM0_CH3},
    {PD_2, BPWM_0_4, SYS_GPD_MFPL_PD2MFP_BPWM0_CH4},
    {PD_3, BPWM_0_5, SYS_GPD_MFPL_PD3MFP_BPWM0_CH5},
    {PD_6, PWM_0_5, SYS_GPD_MFPL_PD6MFP_PWM0_CH5},
    {PD_7, PWM_0_5, SYS_GPD_MFPL_PD7MFP_PWM0_CH5},
    {PD_8, BPWM_0_1, SYS_GPD_MFPH_PD8MFP_BPWM0_CH1},
    {PD_9, BPWM_0_2, SYS_GPD_MFPH_PD9MFP_BPWM0_CH2},
    {PD_12, PWM_1_0, SYS_GPD_MFPH_PD12MFP_PWM1_CH0},
    {PD_13, PWM_1_1, SYS_GPD_MFPH_PD13MFP_PWM1_CH1},
    {PD_14, PWM_1_2, SYS_GPD_MFPH_PD14MFP_PWM1_CH2},
    {PD_15, PWM_1_3, SYS_GPD_MFPH_PD15MFP_PWM1_CH3},
    {PE_0, BPWM_0_0, SYS_GPE_MFPL_PE0MFP_BPWM0_CH0},
    {PE_0, PWM_0_0, SYS_GPE_MFPL_PE0MFP_PWM0_CH0},
    {PE_0, PWM_0_5, SYS_GPE_MFPL_PE0MFP_PWM0_CH5},
    {PE_1, PWM_0_1, SYS_GPE_MFPL_PE1MFP_PWM0_CH1},
    {PE_2, PWM_1_1, SYS_GPE_MFPL_PE2MFP_PWM1_CH1},
    {PE_3, PWM_0_3, SYS_GPE_MFPL_PE3MFP_PWM0_CH3},
    {PE_8, BPWM_1_0, SYS_GPE_MFPH_PE8MFP_BPWM1_CH0},
    {PE_9, BPWM_1_1, SYS_GPE_MFPH_PE9MFP_BPWM1_CH1},
    {PE_10, BPWM_1_2, SYS_GPE_MFPH_PE10MFP_BPWM1_CH2},
    {PE_10, PWM_1_0, SYS_GPE_MFPH_PE10MFP_PWM1_CH0},
    {PE_11, BPWM_1_3, SYS_GPE_MFPH_PE11MFP_BPWM1_CH3},
    {PE_11, PWM_1_1, SYS_GPE_MFPH_PE11MFP_PWM1_CH1},
    {PE_12, BPWM_1_4, SYS_GPE_MFPH_PE12MFP_BPWM1_CH4},
    {PE_12, PWM_0_4, SYS_GPE_MFPH_PE12MFP_PWM0_CH4},
    {PE_13, BPWM_1_5, SYS_GPE_MFPH_PE13MFP_BPWM1_CH5},
    {PE_13, PWM_0_5, SYS_GPE_MFPH_PE13MFP_PWM0_CH5},
    {PF_2, PWM_0_5, SYS_GPF_MFPL_PF2MFP_PWM0_CH5},
    {PF_3, PWM_1_4, SYS_GPF_MFPL_PF3MFP_PWM1_CH4},
    {PF_4, PWM_1_5, SYS_GPF_MFPL_PF4MFP_PWM1_CH5},
    {PF_5, BPWM_1_0, SYS_GPF_MFPL_PF5MFP_BPWM1_CH0},
    {PF_6, BPWM_1_1, SYS_GPF_MFPL_PF6MFP_BPWM1_CH1},
    {PF_7, PWM_1_0, SYS_GPF_MFPL_PF7MFP_PWM1_CH0},
    {PF_9, PWM_1_0, SYS_GPF_MFPH_PF9MFP_PWM1_CH0},
    {PF_10, PWM_1_1, SYS_GPF_MFPH_PF10MFP_PWM1_CH1},
    {PF_11, PWM_1_2, SYS_GPF_MFPH_PF11MFP_PWM1_CH2},
    {PG_1, PWM_1_2, SYS_GPG_MFPL_PG1MFP_PWM1_CH2},
    {PG_2, PWM_1_3, SYS_GPG_MFPL_PG2MFP_PWM1_CH3},
    {PG_3, PWM_1_4, SYS_GPG_MFPL_PG3MFP_PWM1_CH4},
    {PG_4, PWM_1_5, SYS_GPG_MFPL_PG4MFP_PWM1_CH5},
    
    {NC,    NC,    0}
};

//*** SERIAL ***

const PinMap PinMap_UART_TX[] = {
    {PA_0, UART_1, SYS_GPA_MFPL_PA0MFP_UART1_TXD},
    {PA_2, UART_0, SYS_GPA_MFPL_PA2MFP_UART0_TXD},
    {PA_8, UART_3, SYS_GPA_MFPH_PA8MFP_UART3_TXD},
    {PA_13, UART_2, SYS_GPA_MFPH_PA13MFP_UART2_TXD},
    {PB_1, UART_2, SYS_GPB_MFPL_PB1MFP_UART2_TXD},
    {PB_3, UART_1, SYS_GPB_MFPL_PB3MFP_UART1_TXD},
    {PB_3, UART_3, SYS_GPB_MFPL_PB3MFP_UART3_TXD},
    {PB_4, UART_2, SYS_GPB_MFPL_PB4MFP_UART2_TXD},
    {PB_4, UART_4, SYS_GPB_MFPL_PB4MFP_UART4_TXD},
    {PB_5, UART_5, SYS_GPB_MFPL_PB5MFP_UART5_TXD},
    {PB_6, UART_4, SYS_GPB_MFPL_PB6MFP_UART4_TXD},
    {PB_11, UART_5, SYS_GPB_MFPH_PB11MFP_UART5_TXD},
    {PC_0, UART_3, SYS_GPC_MFPL_PC0MFP_UART3_TXD},
    {PC_2, UART_2, SYS_GPC_MFPL_PC2MFP_UART2_TXD},
    {PC_5, UART_4, SYS_GPC_MFPL_PC5MFP_UART4_TXD},
    {PC_7, UART_0, SYS_GPC_MFPL_PC7MFP_UART0_TXD},
    {PD_1, UART_0, SYS_GPD_MFPL_PD1MFP_UART0_TXD},
    {PD_2, UART_3, SYS_GPD_MFPL_PD2MFP_UART3_TXD},
    {PD_12, UART_3, SYS_GPD_MFPH_PD12MFP_UART3_TXD},
    {PE_8, UART_1, SYS_GPE_MFPH_PE8MFP_UART1_TXD},
    {PE_10, UART_3, SYS_GPE_MFPH_PE10MFP_UART3_TXD},
    {PE_12, UART_1, SYS_GPE_MFPH_PE12MFP_UART1_TXD},
    {PE_12, UART_4, SYS_GPE_MFPH_PE12MFP_UART4_TXD},
    {PF_5, UART_3, SYS_GPF_MFPL_PF5MFP_UART3_TXD},
    {PF_6, UART_0, SYS_GPF_MFPL_PF6MFP_UART0_TXD},
    {PF_7, UART_3, SYS_GPF_MFPL_PF7MFP_UART3_TXD},
    {PF_9, UART_3, SYS_GPF_MFPH_PF9MFP_UART3_TXD},
    {PF_13, UART_5, SYS_GPF_MFPH_PF13MFP_UART5_TXD},
    {PG_2, UART_2, SYS_GPG_MFPL_PG2MFP_UART2_TXD},
    {PG_8, UART_0, SYS_GPG_MFPH_PG8MFP_UART0_TXD},
    {PG_10, UART_5, SYS_GPG_MFPH_PG10MFP_UART5_TXD},
    
    {NC,    NC,     0}
};

const PinMap PinMap_UART_RX[] = {
    {PA_1, UART_1, SYS_GPA_MFPL_PA1MFP_UART1_RXD},
    {PA_3, UART_0, SYS_GPA_MFPL_PA3MFP_UART0_RXD},
    {PA_9, UART_3, SYS_GPA_MFPH_PA9MFP_UART3_RXD},
    {PA_12, UART_2, SYS_GPA_MFPH_PA12MFP_UART2_RXD},
    {PB_0, UART_2, SYS_GPB_MFPL_PB0MFP_UART2_RXD},
    {PB_2, UART_1, SYS_GPB_MFPL_PB2MFP_UART1_RXD},
    {PB_2, UART_3, SYS_GPB_MFPL_PB2MFP_UART3_RXD},
    {PB_5, UART_2, SYS_GPB_MFPL_PB5MFP_UART2_RXD},
    {PB_7, UART_4, SYS_GPB_MFPL_PB7MFP_UART4_RXD},
    {PB_8, UART_4, SYS_GPB_MFPH_PB8MFP_UART4_RXD},
    {PB_12, UART_5, SYS_GPB_MFPH_PB12MFP_UART5_RXD},
    {PB_15, UART_5, SYS_GPB_MFPH_PB15MFP_UART5_RXD},
    {PC_1, UART_3, SYS_GPC_MFPL_PC1MFP_UART3_RXD},
    {PC_3, UART_2, SYS_GPC_MFPL_PC3MFP_UART2_RXD},
    {PC_6, UART_0, SYS_GPC_MFPL_PC6MFP_UART0_RXD},
    {PC_6, UART_4, SYS_GPC_MFPL_PC6MFP_UART4_RXD},
    {PD_0, UART_0, SYS_GPD_MFPL_PD0MFP_UART0_RXD},
    {PD_0, UART_5, SYS_GPD_MFPL_PD0MFP_UART5_RXD},
    {PD_1, UART_5, SYS_GPD_MFPL_PD1MFP_UART5_RXD},
    {PD_3, UART_3, SYS_GPD_MFPL_PD3MFP_UART3_RXD},
    {PD_6, UART_0, SYS_GPD_MFPL_PD6MFP_UART0_RXD},
    {PD_13, UART_3, SYS_GPD_MFPH_PD13MFP_UART3_RXD},
    {PE_0, UART_4, SYS_GPE_MFPL_PE0MFP_UART4_RXD},
    {PE_1, UART_1, SYS_GPE_MFPL_PE1MFP_UART1_RXD},
    {PE_9, UART_1, SYS_GPE_MFPH_PE9MFP_UART1_RXD},
    {PE_11, UART_3, SYS_GPE_MFPH_PE11MFP_UART3_RXD},
    {PE_13, UART_1, SYS_GPE_MFPH_PE13MFP_UART1_RXD},
    {PE_13, UART_4, SYS_GPE_MFPH_PE13MFP_UART4_RXD},
    {PF_5, UART_0, SYS_GPF_MFPL_PF5MFP_UART0_RXD},
    {PF_6, UART_3, SYS_GPF_MFPL_PF6MFP_UART3_RXD},
    {PF_10, UART_3, SYS_GPF_MFPH_PF10MFP_UART3_RXD},
    {PF_12, UART_5, SYS_GPF_MFPH_PF12MFP_UART5_RXD},
    {PG_1, UART_2, SYS_GPG_MFPL_PG1MFP_UART2_RXD},
    {PG_7, UART_0, SYS_GPG_MFPL_PG7MFP_UART0_RXD},
    {PG_9, UART_5, SYS_GPG_MFPH_PG9MFP_UART5_RXD},
    
    {NC,    NC,     0}
};

