ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M2351/TARGET_NUMAKER_PFM_M2351/PeripheralPins.c
const PinMap PinMap_UART_RTS[] = {
    {PA_1, UART_1, SYS_GPA_MFPL_PA1MFP_UART1_nRTS},
    {PA_3, UART_0, SYS_GPA_MFPL_PA3MFP_UART0_nRTS},
    {PA_11, UART_3, SYS_GPA_MFPH_PA11MFP_UART3_nRTS},
    {PA_15, UART_2, SYS_GPA_MFPH_PA15MFP_UART2_nRTS},
    {PB_8, UART_1, SYS_GPB_MFPH_PB8MFP_UART1_nRTS},
    {PB_9, UART_5, SYS_GPB_MFPH_PB9MFP_UART5_nRTS},
    {PB_12, UART_4, SYS_GPB_MFPH_PB12MFP_UART4_nRTS},
    {PC_1, UART_2, SYS_GPC_MFPL_PC1MFP_UART2_nRTS},
    {PC_7, UART_4, SYS_GPC_MFPL_PC7MFP_UART4_nRTS},
    {PD_15, UART_3, SYS_GPD_MFPH_PD15MFP_UART3_nRTS},
    {PE_8, UART_4, SYS_GPE_MFPH_PE8MFP_UART4_nRTS},
    {PE_11, UART_1, SYS_GPE_MFPH_PE11MFP_UART1_nRTS},
    {PF_15, UART_5, SYS_GPF_MFPH_PF15MFP_UART5_nRTS},
    {PG_4, UART_2, SYS_GPG_MFPL_PG4MFP_UART2_nRTS},
    {PG_12, UART_5, SYS_GPG_MFPH_PG12MFP_UART5_nRTS},
    
    {NC,    NC,     0}
};

const PinMap PinMap_UART_CTS[] = {
    {PA_0, UART_1, SYS_GPA_MFPL_PA0MFP_UART1_nCTS},
    {PA_2, UART_0, SYS_GPA_MFPL_PA2MFP_UART0_nCTS},
    {PA_10, UART_3, SYS_GPA_MFPH_PA10MFP_UART3_nCTS},
    {PA_14, UART_2, SYS_GPA_MFPH_PA14MFP_UART2_nCTS},
    {PB_4, UART_1, SYS_GPB_MFPL_PB4MFP_UART1_nCTS},
    {PB_10, UART_5, SYS_GPB_MFPH_PB10MFP_UART5_nCTS},
    {PB_11, UART_4, SYS_GPB_MFPH_PB11MFP_UART4_nCTS},
    {PC_0, UART_2, SYS_GPC_MFPL_PC0MFP_UART2_nCTS},
    {PC_4, UART_4, SYS_GPC_MFPL_PC4MFP_UART4_nCTS},
    {PD_14, UART_3, SYS_GPD_MFPH_PD14MFP_UART3_nCTS},
    {PE_9, UART_4, SYS_GPE_MFPH_PE9MFP_UART4_nCTS},
    {PE_10, UART_1, SYS_GPE_MFPH_PE10MFP_UART1_nCTS},
    {PF_11, UART_3, SYS_GPF_MFPH_PF11MFP_UART3_nCTS},
    {PF_14, UART_5, SYS_GPF_MFPH_PF14MFP_UART5_nCTS},
    {PG_3, UART_2, SYS_GPG_MFPL_PG3MFP_UART2_nCTS},
    {PG_11, UART_5, SYS_GPG_MFPH_PG11MFP_UART5_nCTS},
    
    {NC,    NC,     0}
};

//*** SPI ***

const PinMap PinMap_SPI_MOSI[] = {
    {PA_1, SPI_5, SYS_GPA_MFPL_PA1MFP_SPI5_MOSI},
    {PA_3, SPI_3, SYS_GPA_MFPL_PA3MFP_SPI3_MOSI},
    {PA_5, SPI_1, SYS_GPA_MFPL_PA5MFP_SPI1_MOSI},
    {PA_15, SPI_1, SYS_GPA_MFPH_PA15MFP_SPI1_MOSI},
    {PB_0, SPI_0, SYS_GPB_MFPL_PB0MFP_SPI0_MOSI1},
    {PB_1, SPI_1, SYS_GPB_MFPL_PB1MFP_SPI1_MOSI},
    {PB_5, SPI_0, SYS_GPB_MFPL_PB5MFP_SPI0_MOSI0},
    {PB_5, SPI_1, SYS_GPB_MFPL_PB5MFP_SPI1_MOSI},
    {PB_12, SPI_4, SYS_GPB_MFPH_PB12MFP_SPI4_MOSI},
    {PC_1, SPI_0, SYS_GPC_MFPL_PC1MFP_SPI0_MOSI1},
    {PC_3, SPI_0, SYS_GPC_MFPL_PC3MFP_SPI0_MOSI0},
    {PC_3, SPI_2, SYS_GPC_MFPL_PC3MFP_SPI2_MOSI},
    {PC_3, SPI_5, SYS_GPC_MFPL_PC3MFP_SPI5_MOSI},
    {PC_6, SPI_5, SYS_GPC_MFPL_PC6MFP_SPI5_MOSI},
    {PC_10, SPI_2, SYS_GPC_MFPH_PC10MFP_SPI2_MOSI},
    {PD_9, SPI_2, SYS_GPD_MFPH_PD9MFP_SPI2_MOSI},
    {PD_11, SPI_1, SYS_GPD_MFPH_PD11MFP_SPI1_MOSI},
    {PD_13, SPI_2, SYS_GPD_MFPH_PD13MFP_SPI2_MOSI},
    {PE_3, SPI_1, SYS_GPE_MFPL_PE3MFP_SPI1_MOSI},
    {PE_9, SPI_0, SYS_GPE_MFPH_PE9MFP_SPI0_MOSI1},
    {PE_11, SPI_0, SYS_GPE_MFPH_PE11MFP_SPI0_MOSI0},
    {PE_11, SPI_1, SYS_GPE_MFPH_PE11MFP_SPI1_MOSI},
    {PE_13, SPI_5, SYS_GPE_MFPH_PE13MFP_SPI5_MOSI},
    {PF_1, SPI_1, SYS_GPF_MFPL_PF1MFP_SPI1_MOSI},
    {PF_10, SPI_2, SYS_GPF_MFPH_PF10MFP_SPI2_MOSI},
    {PF_13, SPI_1, SYS_GPF_MFPH_PF13MFP_SPI1_MOSI},
    {PG_2, SPI_0, SYS_GPG_MFPL_PG2MFP_SPI0_MOSI0},
    
    {NC,    NC,    0}
};

const PinMap PinMap_SPI_MISO[] = {
    {PA_0, SPI_3, SYS_GPA_MFPL_PA0MFP_SPI3_MISO},
    {PA_0, SPI_5, SYS_GPA_MFPL_PA0MFP_SPI5_MISO},
    {PA_6, SPI_1, SYS_GPA_MFPL_PA6MFP_SPI1_MISO},
    {PA_14, SPI_1, SYS_GPA_MFPH_PA14MFP_SPI1_MISO},
    {PB_1, SPI_0, SYS_GPB_MFPL_PB1MFP_SPI0_MISO1},
    {PB_3, SPI_0, SYS_GPB_MFPL_PB3MFP_SPI0_MISO0},
    {PB_3, SPI_1, SYS_GPB_MFPL_PB3MFP_SPI1_MISO},
    {PB_6, SPI_0, SYS_GPB_MFPL_PB6MFP_SPI0_MISO0},
    {PB_6, SPI_1, SYS_GPB_MFPL_PB6MFP_SPI1_MISO},
    {PB_11, SPI_4, SYS_GPB_MFPH_PB11MFP_SPI4_MISO},
    {PC_0, SPI_0, SYS_GPC_MFPL_PC0MFP_SPI0_MISO1},
    {PC_2, SPI_0, SYS_GPC_MFPL_PC2MFP_SPI0_MISO0},
    {PC_2, SPI_5, SYS_GPC_MFPL_PC2MFP_SPI5_MISO},
    {PC_4, SPI_2, SYS_GPC_MFPL_PC4MFP_SPI2_MISO},
    {PC_7, SPI_5, SYS_GPC_MFPL_PC7MFP_SPI5_MISO},
    {PC_11, SPI_2, SYS_GPC_MFPH_PC11MFP_SPI2_MISO},
    {PD_1, SPI_2, SYS_GPD_MFPL_PD1MFP_SPI2_MISO},
    {PD_5, SPI_1, SYS_GPD_MFPL_PD5MFP_SPI1_MISO},
    {PD_12, SPI_1, SYS_GPD_MFPH_PD12MFP_SPI1_MISO},
    {PD_14, SPI_2, SYS_GPD_MFPH_PD14MFP_SPI2_MISO},
    {PE_2, SPI_3, SYS_GPE_MFPL_PE2MFP_SPI3_MISO},
    {PE_8, SPI_0, SYS_GPE_MFPH_PE8MFP_SPI0_MISO1},
    {PE_10, SPI_0, SYS_GPE_MFPH_PE10MFP_SPI0_MISO0},
    {PE_10, SPI_1, SYS_GPE_MFPH_PE10MFP_SPI1_MISO},
    {PE_12, SPI_5, SYS_GPE_MFPH_PE12MFP_SPI5_MISO},
    {PF_7, SPI_1, SYS_GPF_MFPL_PF7MFP_SPI1_MISO},
    {PF_11, SPI_2, SYS_GPF_MFPH_PF11MFP_SPI2_MISO},
    {PF_12, SPI_1, SYS_GPF_MFPH_PF12MFP_SPI1_MISO},
    {PG_1, SPI_0, SYS_GPG_MFPL_PG1MFP_SPI0_MISO0},
    
    {NC,    NC,    0}
};

const PinMap PinMap_SPI_SCLK[] = {
    {PA_0, SPI_1, SYS_GPA_MFPL_PA0MFP_SPI1_I2SMCLK},
    {PA_1, SPI_3, SYS_GPA_MFPL_PA1MFP_SPI3_CLK},
    {PA_3, SPI_5, SYS_GPA_MFPL_PA3MFP_SPI5_CLK},
    {PA_7, SPI_1, SYS_GPA_MFPL_PA7MFP_SPI1_CLK},
    {PA_12, SPI_1, SYS_GPA_MFPH_PA12MFP_SPI1_I2SMCLK},
    {PA_12, SPI_2, SYS_GPA_MFPH_PA12MFP_SPI2_I2SMCLK},
    {PA_12, SPI_3, SYS_GPA_MFPH_PA12MFP_SPI3_I2SMCLK},
    {PA_13, SPI_1, SYS_GPA_MFPH_PA13MFP_SPI1_CLK},
    {PB_2, SPI_0, SYS_GPB_MFPL_PB2MFP_SPI0_CLK},
    {PB_2, SPI_1, SYS_GPB_MFPL_PB2MFP_SPI1_CLK},
    {PB_4, SPI_4, SYS_GPB_MFPL_PB4MFP_SPI4_CLK},
    {PB_7, SPI_0, SYS_GPB_MFPL_PB7MFP_SPI0_CLK},
    {PB_7, SPI_1, SYS_GPB_MFPL_PB7MFP_SPI1_CLK},
    {PB_9, SPI_4, SYS_GPB_MFPH_PB9MFP_SPI4_I2SMCLK},
    {PB_10, SPI_4, SYS_GPB_MFPH_PB10MFP_SPI4_CLK},
    {PC_0, SPI_2, SYS_GPC_MFPL_PC0MFP_SPI2_CLK},
    {PC_1, SPI_2, SYS_GPC_MFPL_PC1MFP_SPI2_I2SMCLK},
    {PC_4, SPI_0, SYS_GPC_MFPL_PC4MFP_SPI0_CLK},
    {PC_4, SPI_5, SYS_GPC_MFPL_PC4MFP_SPI5_CLK},
    {PC_5, SPI_2, SYS_GPC_MFPL_PC5MFP_SPI2_I2SMCLK},
    {PC_8, SPI_2, SYS_GPC_MFPH_PC8MFP_SPI2_I2SMCLK},
    {PC_9, SPI_2, SYS_GPC_MFPH_PC9MFP_SPI2_I2SMCLK},
    {PC_12, SPI_2, SYS_GPC_MFPH_PC12MFP_SPI2_CLK},
    {PC_15, SPI_3, SYS_GPC_MFPH_PC15MFP_SPI3_I2SMCLK},
    {PD_0, SPI_1, SYS_GPD_MFPL_PD0MFP_SPI1_I2SMCLK},
    {PD_1, SPI_3, SYS_GPD_MFPL_PD1MFP_SPI3_I2SMCLK},
    {PD_2, SPI_2, SYS_GPD_MFPL_PD2MFP_SPI2_CLK},
    {PD_3, SPI_1, SYS_GPD_MFPL_PD3MFP_SPI1_I2SMCLK},
    {PD_4, SPI_1, SYS_GPD_MFPL_PD4MFP_SPI1_CLK},
    {PD_10, SPI_1, SYS_GPD_MFPH_PD10MFP_SPI1_CLK},
    {PD_15, SPI_2, SYS_GPD_MFPH_PD15MFP_SPI2_CLK},
    {PE_0, SPI_0, SYS_GPE_MFPL_PE0MFP_SPI0_CLK},
    {PE_0, SPI_2, SYS_GPE_MFPL_PE0MFP_SPI2_CLK},
    {PE_5, SPI_5, SYS_GPE_MFPL_PE5MFP_SPI5_CLK},
    {PE_9, SPI_1, SYS_GPE_MFPH_PE9MFP_SPI1_I2SMCLK},
    {PE_11, SPI_5, SYS_GPE_MFPH_PE11MFP_SPI5_CLK},
    {PE_13, SPI_0, SYS_GPE_MFPH_PE13MFP_SPI0_CLK},
    {PE_13, SPI_1, SYS_GPE_MFPH_PE13MFP_SPI1_CLK},
    {PF_2, SPI_1, SYS_GPF_MFPL_PF2MFP_SPI1_CLK},
    {PF_7, SPI_2, SYS_GPF_MFPL_PF7MFP_SPI2_I2SMCLK},
    {PF_8, SPI_2, SYS_GPF_MFPH_PF8MFP_SPI2_CLK},
    {PF_15, SPI_1, SYS_GPF_MFPH_PF15MFP_SPI1_CLK},
    {PG_3, SPI_0, SYS_GPG_MFPL_PG3MFP_SPI0_CLK},
    
    {NC,    NC,    0}
};

