ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M2351/TARGET_NUMAKER_PFM_M2351/PeripheralPins.c
const PinMap PinMap_SPI_SSEL[] = {
    {PA_2, SPI_3, SYS_GPA_MFPL_PA2MFP_SPI3_SS},
    {PA_2, SPI_5, SYS_GPA_MFPL_PA2MFP_SPI5_SS},
    {PA_4, SPI_1, SYS_GPA_MFPL_PA4MFP_SPI1_SS},
    {PB_0, SPI_1, SYS_GPB_MFPL_PB0MFP_SPI1_SS},
    {PB_4, SPI_0, SYS_GPB_MFPL_PB4MFP_SPI0_SS},
    {PB_4, SPI_1, SYS_GPB_MFPL_PB4MFP_SPI1_SS},
    {PB_8, SPI_4, SYS_GPB_MFPH_PB8MFP_SPI4_SS},
    {PB_15, SPI_1, SYS_GPB_MFPH_PB15MFP_SPI1_SS},
    {PC_2, SPI_2, SYS_GPC_MFPL_PC2MFP_SPI2_SS},
    {PC_5, SPI_0, SYS_GPC_MFPL_PC5MFP_SPI0_SS},
    {PC_5, SPI_5, SYS_GPC_MFPL_PC5MFP_SPI5_SS},
    {PC_13, SPI_2, SYS_GPC_MFPH_PC13MFP_SPI2_SS},
    {PD_6, SPI_1, SYS_GPD_MFPL_PD6MFP_SPI1_SS},
    {PD_8, SPI_2, SYS_GPD_MFPH_PD8MFP_SPI2_SS},
    {PD_12, SPI_2, SYS_GPD_MFPH_PD12MFP_SPI2_SS},
    {PE_0, SPI_0, SYS_GPE_MFPL_PE0MFP_SPI0_SS},
    {PE_4, SPI_5, SYS_GPE_MFPL_PE4MFP_SPI5_SS},
    {PE_10, SPI_5, SYS_GPE_MFPH_PE10MFP_SPI5_SS},
    {PE_12, SPI_0, SYS_GPE_MFPH_PE12MFP_SPI0_SS},
    {PE_12, SPI_1, SYS_GPE_MFPH_PE12MFP_SPI1_SS},
    {PF_0, SPI_1, SYS_GPF_MFPL_PF0MFP_SPI1_SS},
    {PF_9, SPI_2, SYS_GPF_MFPH_PF9MFP_SPI2_SS},
    {PF_14, SPI_1, SYS_GPF_MFPH_PF14MFP_SPI1_SS},
    {PG_4, SPI_0, SYS_GPG_MFPL_PG4MFP_SPI0_SS},
    {PG_8, SPI_1, SYS_GPG_MFPH_PG8MFP_SPI1_SS},
    
    {NC,    NC,    0}
};

const PinMap PinMap_CAN_TD[] = {
    {PA_1, CAN_0, SYS_GPA_MFPL_PA1MFP_CAN0_TXD},
    {PA_12, CAN_0, SYS_GPA_MFPH_PA12MFP_CAN0_TXD},
    {PC_0, CAN_0, SYS_GPC_MFPL_PC0MFP_CAN0_TXD},
    {PF_12, CAN_0, SYS_GPF_MFPH_PF12MFP_CAN0_TXD},
	
    {NC,    NC,     0}
};
    
const PinMap PinMap_CAN_RD[] = { 
    {PA_0, CAN_0, SYS_GPA_MFPL_PA0MFP_CAN0_RXD},
    {PA_13, CAN_0, SYS_GPA_MFPH_PA13MFP_CAN0_RXD},
    {PC_1, CAN_0, SYS_GPC_MFPL_PC1MFP_CAN0_RXD},
    {PF_13, CAN_0, SYS_GPF_MFPH_PF13MFP_CAN0_RXD},
	
    {NC,    NC,    0}
};
